WF/src/Documents/РасходнаяНакладная/РасходнаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасходнаяНакладная</name>
  <basedOn>Document.ЗаказКлиента</basedOn>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиНоменклатуры</registerRecords>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыСКонтрагентами</types>
    </type>
  </attributes>
  <attributes>
    <name>ИтоговаяСумма</name>
    <type>
      <types>DefinedType.ДенежныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокМатериалов</name>
    <attributes>
      <name>Материал</name>
      <type>
        <types>CatalogRef.СписокНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.ДенежныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СписокУслуги</name>
    <attributes>
      <name>Услуга</name>
      <type>
        <types>CatalogRef.СписокНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежныеСредства</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

WF/src/AccumulationRegisters/Продажи/Продажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Продажи</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежныеСредства</types>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.СписокНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

WF/src/AccumulationRegisters/ОстаткиНоменклатуры/ОстаткиНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиНоменклатуры</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.СписокНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.СкладыКомпании</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

WF/src/Documents/РасходнаяНакладная/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
		ЭтотОбъект.ИтоговаяСумма = ЭтотОбъект.СписокМатериалов.Итог("Сумма") + ЭтотОбъект.СписокУслуги.Итог("Сумма");
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		// Заполнение шапки
		Договор = ДанныеЗаполнения.Договор;
		ИтоговаяСумма = ДанныеЗаполнения.ИтоговаяСумма;
		Поставщик = ДанныеЗаполнения.Поставщик;
		Основание = ДанныеЗаполнения.Ссылка;
		Для Каждого ТекСтрокаСписокМатериалов Из ДанныеЗаполнения.СписокМатериалов Цикл
			НоваяСтрока = СписокМатериалов.Добавить();
			НоваяСтрока.Количество = ТекСтрокаСписокМатериалов.Количество;
			НоваяСтрока.Материал = ТекСтрокаСписокМатериалов.Материал;
			НоваяСтрока.ПроцентСкидки = ТекСтрокаСписокМатериалов.ПроцентСкидки;
			НоваяСтрока.Сумма = ТекСтрокаСписокМатериалов.Сумма;
			НоваяСтрока.Цена = ТекСтрокаСписокМатериалов.Цена;
		КонецЦикла;
		Для Каждого ТекСтрокаСписокУслуги Из ДанныеЗаполнения.СписокУслуги Цикл
			НоваяСтрока = СписокУслуги.Добавить();
			НоваяСтрока.Сумма = ТекСтрокаСписокУслуги.Сумма;
			НоваяСтрока.Услуга = ТекСтрокаСписокУслуги.Услуга;
		КонецЦикла;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Продажи 
	Для Каждого ТекСтрокаСписокМатериалов Из СписокМатериалов Цикл
		Движение = Движения.Продажи.Добавить();
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаСписокМатериалов.Материал;
		Движение.Контрагент = Поставщик;
		Движение.Сумма = ТекСтрокаСписокМатериалов.Сумма;
		Движение.Количество = ТекСтрокаСписокМатериалов.Количество;
	КонецЦикла;

	// регистр Продажи 
	Движения.Продажи.Записывать = Истина;
	Для Каждого ТекСтрокаСписокУслуги Из СписокУслуги Цикл
		Движение = Движения.Продажи.Добавить();
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаСписокУслуги.Услуга;
		Движение.Контрагент = Поставщик;
		Движение.Сумма = ТекСтрокаСписокУслуги.Сумма;
		Движение.Количество = 1;
	КонецЦикла;

	// регистр ОстаткиНоменклатуры Расход
	Движения.ОстаткиНоменклатуры.Записывать = Истина;
	Для Каждого ТекСтрокаСписокМатериалов Из СписокМатериалов Цикл
		Движение = Движения.ОстаткиНоменклатуры.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаСписокМатериалов.Материал;
		Движение.Количество = ТекСтрокаСписокМатериалов.Количество;
		Движение.Склад = ЭтотОбъект.Склад
	КонецЦикла;
	Движения.ОстаткиНоменклатуры.Записать();
	Отказ = РегистрыНакопления.ОстаткиНоменклатуры.ПроверитьОтрицательныеОстаткиСырья(ЭтотОбъект.Ссылка, ЭтотОбъект.Дата, ЭтотОбъект.Склад);
		
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры


	
#КонецОбласти
